其他/gfm简介.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-01-17 日 20:05 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>gfm简介</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="万泽(德山书生)">
<meta  name="description" content="制作者邮箱：a358003542@gmail.com"
>
</head>
<body>
<div id="content">
<header>
<h1 class="title">gfm简介</h1>
</header><p>
gfm的官方文档在 <a href="https://help.github.com/articles/github-flavored-markdown/">这里</a> 。本文大体简要说明一下。
</p>

<p>
关于markdown最基本的语法简介，我写了 <a href="https://a358003542.gitbooks.io/markdown-learning-notes/content/">一篇文章</a> ，读者可以看一下。
</p>

<p>
github flavored markdown 也就是github的markdown方言，其主要区别有:
</p>

<ol class="org-ol">
<li>下划线直接为下划线，下划线确实更多的是表现层而非内容层的东西，实际上org-mode我都希望下划线取消掉算了。</li>

<li>URL 直接输入，比如 <a href="http://www.google.com/">http://www.google.com/</a> ，其将直接转化成为链接。具体读者可以在 <a href="https://stackedit.io/editor">这个网页</a> 上测试一下，其在google chrome里有个插件，叫 <em>StackEdit</em> 。这个只是一个新功能支持，实际上原来的链接插入方式一样有效。</li>

<li>删除线 用:</li>
</ol>
<pre>
~~删除线~~
</pre>
<p>
属于添加的新特性。这个据我所指org-mode里面也是没有的。
</p>

<ol class="org-ol">
<li>当然最有名的就是代码块的染色支持了。</li>
</ol>

<pre>
```elisp
(+ 1 1)
```
</pre>

<p>
其中语言列表可以参看 <a href="https://github.com/github/linguist/blob/master/lib/linguist/languages.yml">这里</a> 。
</p>

<ol class="org-ol">
<li>表格的额外特性支持，暂时我不太关心，略过了。</li>

<li>html代码可以直接写进去，这个似乎讲起来markdown原义也是支持的。</li>
</ol>
</div>
</body>
</html>
